<?php
/**
 * Created by PhpStorm.
 * User: ilja
 * Date: 17.11.13
 * Time: 10:08
 */

class Html {

	public static function clearStringForUrl ($str)
	{
		$str = strtolower($str);

		// русский в транслит
		$converter = array(
			'а' => 'a', 'б' => 'b', 'в' => 'v',
			'г' => 'g', 'д' => 'd', 'е' => 'e',
			'ё' => 'e', 'ж' => 'zh', 'з' => 'z',
			'и' => 'i', 'й' => 'y', 'к' => 'k',
			'л' => 'l', 'м' => 'm', 'н' => 'n',
			'о' => 'o', 'п' => 'p', 'р' => 'r',
			'с' => 's', 'т' => 't', 'у' => 'u',
			'ф' => 'f', 'х' => 'h', 'ц' => 'c',
			'ч' => 'ch', 'ш' => 'sh', 'щ' => 'sch',
			'ь' => "", 'ы' => 'y', 'ъ' => "",
			'э' => 'e', 'ю' => 'yu', 'я' => 'ya',

			'А' => 'A', 'Б' => 'B', 'В' => 'V',
			'Г' => 'G', 'Д' => 'D', 'Е' => 'E',
			'Ё' => 'E', 'Ж' => 'Zh', 'З' => 'Z',
			'И' => 'I', 'Й' => 'Y', 'К' => 'K',
			'Л' => 'L', 'М' => 'M', 'Н' => 'N',
			'О' => 'O', 'П' => 'P', 'Р' => 'R',
			'С' => 'S', 'Т' => 'T', 'У' => 'U',
			'Ф' => 'F', 'Х' => 'H', 'Ц' => 'C',
			'Ч' => 'Ch', 'Ш' => 'Sh', 'Щ' => 'Sch',
			'Ь' => "", 'Ы' => 'Y', 'Ъ' => "",
			'Э' => 'E', 'Ю' => 'Yu', 'Я' => 'Ya',
		);
		$str = strtr($str, $converter);
		$str = strtolower($str);

		// очищаем еще символы
		$converter = array(
			'!' => '',
			'(' => '',
			')' => '',
			'.' => '',
			',' => '',
			';' => '',
			':' => '',
			' ' => '_',
			'@' => '',
			'&' => '',
			'\'' => '',
			'"' => '',
			'№' => '',
			'%' => '',
			'?' => '',
			'*' => '',
			' ' => '',
		);
		$str = strtr($str, $converter);

		if ($str != '') {
			$str = urlencode ($str);
		}

		return $str;
	}

} 